export const i18nData = {
    zhCHS: {
        riskTypeList: {
            // 风险等级列表
            100: '--',
            0: '尚未风评',
            1: '低风险及以上可购买',
            2: '中风险及以上可购买',
            3: '高风险及以上可购买1',
            4: '超高风险及以上可购买',
            5: '最高风险'
        }
    },
    zhCHT: {
        riskTypeList: {
            100: '--',
            0: '尚未风评',
            1: '低风险及以上可购买',
            2: '中风险及以上可购买',
            3: '高风险及以上可购买3',
            4: '超高风险及以上可购买',
            5: '最高风险'
        }
    },
    en: {
        riskTypeList: {
            100: '--',
            0: '尚未风评',
            1: '低风险及以上可购买',
            2: '中风险及以上可购买',
            3: '高风险及以上可购买2',
            4: '超高风险及以上可购买',
            5: '最高风险'
        }
    }
}
