export const i18nData = {
    zhCHS: {
        riskTypeList: {
            // 风险等级列表
            100: '--',
            0: '尚未风评',
            1: '低风险及以上可购买',
            2: '中低风险及以上可购买',
            3: '中风险及以上可购买',
            4: '中高风险及以上可购买',
            5: '高风险'
        }
    },
    zhCHT: {
        riskTypeList: {
            100: '--',
            0: '尚未風評',
            1: '低風險及以上可購買',
            2: '中風險及以上可購買',
            3: '高風險及以上可購買',
            4: '超高風險及以上可購買',
            5: '高風險'
        }
    },
    en: {
        riskTypeList: {
            100: '--',
            0: '尚未风评',
            1: '低风险及以上可购买',
            2: '中风险及以上可购买',
            3: '高风险及以上可购买2',
            4: '超高风险及以上可购买',
            5: '最高风险'
        }
    }
}
