<template lang="pug">
.commission-rule
    .rule__title 港股佣金规则说明
    .rule__content 
        p.rule__content-h 1. 佣金计划收费说明：
        p.rule__line
            span 1) 免佣计划:
            |  免佣期内可选择免佣计划，享港股交易0佣金，12港元/笔平台使用费；
        p.rule__line
            span 2) 免平台费计划:
            |  享港股交易0平台使用费，根据账户总资产阶梯收费，各阶梯收费如下：
        rule-table(:table="$t(`hkTable`)")

        p.rule__content-h 2. 代收费项目说明：
        rule-table(:table="$t(`hkTable1`)")

        p.rule__content-h 3. 计划切换规则：
        p 1) 1个自然月内，用户有1次机会从免佣计划切换为免平台费计划；
        p 2) 1个自然月内，用户从免平台费计划切换为免佣计划不限次数；
        p 3) 切换佣金计划后，新的佣金计划从下一天开始生效。

        p.rule__content-h 4. 注意事项：
        p 1) 本收费标准仅适用于中国内地用户；
        p 2) 买卖股票时，每笔订单如分成多次成交，只按订单收取一次费用；
        p 3) 使用免平台费计划时，友信证券会按照"0≤总资产<20万"档(0.08%佣金，5港元最低佣金)进行预收费，每日结算时再按照您所属档位的实际收费返佣或补扣；
        p 4) 代收费项目，请以交易所及政府收费为准，具体请查看交易所网站。

</template>

<script>
import RuleTable from './rule-table.vue'
export default {
    i18n: {
        zhCHT: {
            hkTable: [
                [
                    `账户总资产 <br>（单位：港元）`,
                    `佣金`,
                    `最低佣金`,
                    `平台使用费`
                ],
                [`0≤总资产＜20万`, `0.08%`, `5港元/笔`, `0港元/笔`],
                [`20万≤总资产＜50万`, `0.05%`, `5港元/笔`, `0港元/笔`],
                [`50万≤总资产＜100万`, `0.03%`, `0港元/笔`, `0港元/笔`],
                [`总资产≥100万`, `0.02%`, `0港元/笔`, `0港元/笔`]
            ],
            hkTable1: [
                [`类型`, `收费标准`, `收费方`],
                [`交易系统使用费`, `0.5港元`, `香港交易所`],
                [`交易费`, `0.005%*交易值`, `香港交易所`],
                [
                    `结算交收费`,
                    `0.002%*交易值<br>（最低2港元，最高100港元）`,
                    `香港结算所`
                ],
                [
                    `交易征费`,
                    `0.0027%*交易值<br>（不足1港元亦作1港元计算）`,
                    `香港证监会`
                ],
                [
                    `印花税`,
                    `0.1%*交易值<br>（不足1港元亦作1港元计算）`,
                    `香港政府`
                ]
            ]
        },
        zhCHS: {
            hkTable: [
                [
                    `账户总资产 <br>（单位：港元）`,
                    `佣金`,
                    `最低佣金`,
                    `平台使用费`
                ],
                [`0≤总资产＜20万`, `0.08%`, `5港元/笔`, `0港元/笔`],
                [`20万≤总资产＜50万`, `0.05%`, `5港元/笔`, `0港元/笔`],
                [`50万≤总资产＜100万`, `0.03%`, `0港元/笔`, `0港元/笔`],
                [`总资产≥100万`, `0.02%`, `0港元/笔`, `0港元/笔`]
            ],
            hkTable1: [
                [`类型`, `收费标准`, `收费方`],
                [`交易系统使用费`, `0.5港元`, `香港交易所`],
                [`交易费`, `0.005%*交易值`, `香港交易所`],
                [
                    `结算交收费`,
                    `0.002%*交易值<br>（最低2港元，最高100港元）`,
                    `香港结算所`
                ],
                [
                    `交易征费`,
                    `0.0027%*交易值<br>（不足1港元亦作1港元计算）`,
                    `香港证监会`
                ],
                [
                    `印花税`,
                    `0.1%*交易值<br>（不足1港元亦作1港元计算）`,
                    `香港政府`
                ]
            ]
        }
    },
    components: {
        RuleTable
    }
}
</script>
