<template lang="pug">
.commission-rule
    .rule__title 美股佣金规则说明
    .rule__content 
        p.rule__content-h 1. 佣金计划收费说明：
        p.rule__line
            span 标准计划:
            |  享美股交易0佣金，最低佣金0美元/笔，平台使用费0.005美元/股，最低平台使用费1.5美元/笔。
            
        p.rule__content-h 2. 代收费项目说明：
        rule-table(:table="$t(`tableUS`)")

        p.rule__content-h 3. 注意事项：
        p 1) 本收费标准仅适用于中国内地用户；
        p 2) 交易低价股波动大且存在退市可能，投资者需要注意风险；为保护投资者利益，友信证券最多只收取交易金额的0.5%；
        p 3) 买卖股票时，每笔订单如分成多次成交，只按订单收取一次费用；
        p 4) 证监会规费和交易活动费均仅在卖出时收取。

</template>

<script>
import RuleTable from './rule-table.vue'
export default {
    i18n: {
        zhCHT: {
            tableUS: [
                [`类型`, `收费标准`, `收费方`],
                [`交收费`, `0.003美元/股`, `美国结算机构`],
                [
                    `证监会规费 <br>（仅卖单时收取)`,
                    `0.00207%*交易金额 <br> 最低0.01美元`,
                    `美国证监会`
                ],
                [
                    `交易活动费 <br>（仅卖单时收取)`,
                    `0.000119美元*卖出数量<br>最低0.01美元/笔<br>最高5.95美元/笔`,
                    `美国金融业监管局`
                ]
            ]
        },
        zhCHS: {
            tableUS: [
                [`类型`, `收费标准`, `收费方`],
                [`交收费`, `0.003美元/股`, `美国结算机构`],
                [
                    `证监会规费<br>（仅卖单时收取)`,
                    `0.00207%*交易金额<br>最低0.01美元`,
                    `美国证监会`
                ],
                [
                    `交易活动费<br>（仅卖单时收取)`,
                    `0.000119美元*卖出数量<br>最低0.01美元/笔<br>最高5.95美元/笔`,
                    `美国金融业监管局`
                ]
            ]
        }
    },
    components: {
        RuleTable
    }
}
</script>
