<template lang="pug">
    .authorization-wrap
        .title 个人信息查询及使用授权书
        .authorizer-person
            .authorizer 授权人: {{  authorizer.realName || '--'}}
            .id-card 身份证件号码： {{ authorizer.identifyCode || '--'}}
        .authorizer-text-wrap
            p(v-for="item in authorizerTextList") {{item}}
        .authorizer-sign
            span 授权人签名：
            span.bottom-line {{ authorizer.realName || '--'}}


</template>

<script>
import { createNamespacedHelpers } from 'vuex'
const { mapGetters } = createNamespacedHelpers('apply')
export default {
    name: 'authorization',
    computed: {
        ...mapGetters(['basicInfo']),
        authorizer() {
            return this.basicInfo || {}
        }
    },
    data() {
        return {
            authorizerTextList: [
                ` 一、	本人承诺、保证如下：`,
                `1.	本人提供的一切资料和信息均真实、准确及完整。`,
                `2.	本授权书是一份独立有效的文件，不受本人是否成功在不特定商业银行完成开户、转账或在不特定国家、地区的证券市场的开户、交易的影响。`,
                `3.	本人在本授权书项下做出的各项授权均为不可撤销的，一经签署即发生法律效力。`,
                `4.	本人违反本授权书规定的，本人将承担因此引起的一切后果。`,
                `二、	本人在此同意并授权深圳友证科技有限公司（以下称“被授权人”）可以自行或委托其关联公司通过以下方式不限次数地查询、收集并储存本人的个人信息，被授权人委托其关联公司查询的，该等关联公司有权将其查询到的信息提供给被授权人：`,
                `1.	为开立友信智投平台账户、进行身份核验、通过平台开立证券市场交易账户、进行相关证券交易和资金汇付之需要，本人同意向被授权人提供本人的姓名、身份证件号码和影像、手机号码、住址、银行卡号和影像、身份验证过程中产生的文字、图形、视频数据等相关基本身份信息，以及本人的职业信息（包括但不限于就职状态、就职公司名称、所属行业、职位信息等）、电子邮箱、通讯地址、财务和投资信息（包括但不限于收入、净资产、资产来源、投资金额与目的、投资经验等）、银行账户信息，具体以本人通过友信智投平台实际填写和提交的材料范围为准。`,
                `2.	为进行身份核验、开立证券市场交易账户、向本人提供证券交易、资金汇付、以及证券资金信息、股票持有信息、交易信息查询浏览服务之需要，本人同意被授权人可向第三方信息机构提供上述信息，并收集、储存或依照约定用途使用第三方反馈的相关信息或数据。同时，被授权人可向各国和地区的证券交易所、证券公司或其他第三方信息机构查询、收集本人的股票交易账户信息、银行账户信息。`,
                `三、	本人在此不可撤销地同意并授权被授权人将本人在被授权人处形成或留存的本人个人信息以及被授权人另行查询、收集的本人个人信息用于以下用途：`,
                `1.	审核或委托第三方信息机构审核本人信息真实性、进行身份核验，对本人提交的所有内容进行调查、核实，验证本人提供的信息的真实性、准确性、完整性。`,
                `2. 用于与本人与被授权人发生的所有业务及因业务而发生的相关活动中`,
                `3. 通过短信、电话、微信、电子邮件、站内信、推送等形式向本人推荐被授权人及其关联公司、合作机构的产品及服务`,
                `4.	向本人的交易服务机构（包括但不限于银行、交易所、证券公司等）进行必要的披露。`,
                `5. 向仲裁机构或行政、司法等权力机关提供`,
                `6. 其他法律法规规定或经过本人同意的合法用途`,
                `四、   本人在此同意被授权人之间可以共享本人个人信息，并在本授权书规定的用途范围内储存、使用本人个人信息。`,
                `五、	以上授权适用于本人直接或间接使用被授权人服务的期间。本授权书是一份独立有效的文件，不受本人是否成功在不特定商业银行完成开户、转账或进行不特定国家、地区的股票市场的开户、交易的影响。`,
                `六、   本授权书自本人签署之日起生效，至本人重新签署新的授权书或签署解除授权的书面文件，且新的授权书或文件送达被授权人之日起终止。`,
                `本人在此确认并承诺：`,
                `本人已被明确告知上述条款的概念、内容及法律效果，本人已经知悉、理解上述条款并接受因此产生的风险。`,
                `本人确认并认可，使用深圳市电子商务安全证书管理有限公司的服务通过电子签名以数据电文的方式签署本授权书；使用电子签名签署本授权书是本人的真实意思表示，本人自行享有和承担因签署本授权书而产生的权利、义务和责任，不得以电子签名签署本授权书的方式为由撤销本授权书或者对本授权书效力提出任何异议；本人在本授权书项下作出的各项授权均为不可撤销，本授权书一经本人签署后即于系统记录的签署之日生效，对本人产生法律约束力，并在被授权人或其委托的第三方的服务器上以电子形式保存。`
            ]
        }
    }
}
</script>

<style scoped lang="scss">
.authorization-wrap {
    background-color: #fff;
    padding: $global-padding;
    .title {
        text-align: center;
    }
    .authorizer-sign {
        .bottom-line {
            border-bottom: 1px solid;
            padding-bottom: 3px;
        }
    }
}
</style>
